<a href="https://colab.research.google.com/github/movie112/INU-DILAB/blob/main/dacon/titanic/titanic_basic_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# [재난] 타이타닉: 누가 살아남았을까?   
- 참고: [blog_Titanic 생존자 예측 기본편 #2](https://blog.naver.com/fkdldjs60/221892809660)
- 문자형 데이터를 숫자형으로 변환해서 점수를 올려보자.
---
왜 점수 안오르냐,,,,

In [ ]:
cd drive/MyDrive/data/titanic

[Errno 2] No such file or directory: 'drive/MyDrive/data/titanic'
/content/drive/MyDrive/data/titanic

In [ ]:
import pandas as pd

In [ ]:
train = pd.read_csv('train.csv')
print(train.shape)
train.head()

(891, 12)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
test = pd.read_csv('test.csv')
print(test.shape)
test.head()

(418, 11)

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

In [ ]:
train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [ ]:
test.dtypes

PassengerId      int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

#### 저번에는 숫자형데이터만 따로 뽑아 사용했는데, 이번에는 문자형인 성별과 탑승위치(선착장) 데이터를 숫자형으로 바꿔 숫자형리스트에 추가하겠다.
#### 성별에 어떤 값이 있는지 확인 .unique()

In [ ]:
train['Sex'].unique()

array(['male', 'female'], dtype=object)

In [ ]:
test['Sex'].unique()

array(['male', 'female'], dtype=object)

#### 해당 열에 어떤 값이 있고, 각 값의 개수를 확인 .value_counts()

In [ ]:
train['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [ ]:
test['Sex'].value_counts()

male      266
female    152
Name: Sex, dtype: int64

#### male, female을 숫자형 값으로 변환
  - 간단하게 남성 = 0, 여성 = 1 로 
  - 변환 방법에는 def를 이용해 직접 함수를 정의하거나 lambda를 이용해 간단한 함수로 적용하는 등 다양한 방법 존재
    - 이번에는 간단하기 때문에 __replace__ 기능 사용

In [ ]:
# male = 0 변환
# train['Sex'].replace('male', 0)

- 파이썬이나 데이터 분석에 익숙하지 않은 경우, 새로운 열을 만들어 사용하는 방식 추천!!

In [ ]:
train['Sex_encode'] = train['Sex'].replace('male', 0)
train['Sex_encode']

0           0
1      female
2      female
3      female
4           0
        ...
886         0
887    female
888    female
889         0
890         0
Name: Sex_encode, Length: 891, dtype: object

In [ ]:
# female = 1 변환
train['Sex_encode'] = train['Sex'].replace('female', 1)
train['Sex_encode']

0      male
1         1
2         1
3         1
4      male
       ...
886    male
887       1
888       1
889    male
890    male
Name: Sex_encode, Length: 891, dtype: object

#### 동시에 male, female 바꾸려면 이렇게

In [ ]:
train['Sex_encode'] = train['Sex'].replace('male', 0).replace('female', 1)
train['Sex_encode']

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    1
889    0
890    0
Name: Sex_encode, Length: 891, dtype: int64

In [ ]:
test['Sex_encode'] = train['Sex'].replace('male', 0).replace('female', 1)
test['Sex_encode']

0      0
1      1
2      1
3      1
4      0
      ..
413    0
414    0
415    1
416    1
417    1
Name: Sex_encode, Length: 418, dtype: int64

#### 탑승위치(선착장) 데이터

In [ ]:
train['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [ ]:
test['Embarked'].value_counts()

S    270
C    102
Q     46
Name: Embarked, dtype: int64

#### 탑승위치도 replace를 이용해 0, 1, 2의 값으로 적용

In [ ]:
train['Embarked_encode'] = train['Embarked'].replace('S', 0).replace('C', 1).replace('Q', 2)
test['Embarked_encode'] = test['Embarked'].replace('S', 0).replace('C', 1).replace('Q', 2)

#### 왜? 다른 문자형 데이터인 Name과 Ticket, Cabin은 변환하지 않을까?
  - 각 열의 값들의 종류가 너무 다양하기도 하고 특별한 규칙성을 찾기 어려워 변환할 값을 정해주기 힘들기 때문
  - 추후에 다뤄보자
  
#### 숫자형 데이터에 성별과 선착장을 추가해 머신러닝 적용

In [ ]:
numeric = ['PassengerId', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare', 'Sex_encode', 'Embarked_encode']
numeric

['PassengerId',
 'Pclass',
 'Age',
 'SibSp',
 'Parch',
 'Fare',
 'Sex_encode',
 'Embarked_encode']

#### 숫자형 열 리스트에 Sex_encode, Embarked_encode를 추가하고 정리 해준다.

In [ ]:
x_train = train[numeric]
x_test = test[numeric]
y_train = train['Survived']

#### 결측값 확인

In [ ]:
x_train.isnull().sum()

PassengerId          0
Pclass               0
Age                177
SibSp                0
Parch                0
Fare                 0
Sex_encode           0
Embarked_encode      2
dtype: int64

In [ ]:
y_train.isnull().sum()

0

In [ ]:
x_test.isnull().sum()

PassengerId         0
Pclass              0
Age                86
SibSp               0
Parch               0
Fare                1
Sex_encode          0
Embarked_encode     0
dtype: int64

#### age, fare의 결측값은 각 열의 평균값을, embarked_encode에는 0, 1, 2 중 하나를 대입해서 정리

In [ ]:
x_train['Age'] = x_train['Age'].fillna(x_train['Age'].mean())
x_train['Embarked_encode'] = x_train['Embarked_encode'].fillna(0)

x_test['Age'] = x_test['Age'].fillna(x_test['Age'].mean())
x_test['Fare'] = x_test['Fare'].fillna(x_test['Fare'].mean())

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.
/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

#### 머신러닝 모델을 불러오고 데이터 적용

In [ ]:
from sklearn.tree import DecisionTreeClassifier
model = DecisionTreeClassifier()
model

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [ ]:
model.fit(x_train, y_train)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

#### 예측값을 만들어 제출 파일 생성

In [ ]:
y_test = model.predict(x_test)

In [ ]:
submit = pd.read_csv('sample_submission.csv')
submit['Survived'] = y_test
submit.to_csv('final_result2.csv', index = False)